{
    "nav": {
        "about": "About",
        "portfolio": "Portfolio",
        "contact": "Contact us",
        "how": "How we work"
    },
    "home": {
        "headline": "We create hand-crafted software for your business from the initial prototype to completion",
        "learn": "Learn more",
        "description": {
            "title": "Software development for web and mobile",
            "paragraph": "At <company>CREATIVE APPS</company> we bring ideas to life. We are focused on collaboration and understanding your project's <needs>needs</needs>. We create <custom>custom software</custom>, apps and websites that add <value>real value</value> to your business. We can also do general <consultancy>IT consultancy</consultancy> for agencies and startups for the creation of their digital <product>products.</product>"
        },
        "web": {
            "title": "Web Development",
            "paragraph": "Whether you have an idea of how your website should look, or detailed specifications, we use our technical expertise to help you bring it to life."
        },
        "mobile": {
            "title": "Mobile development",
            "paragraph": "We build awesome custom mobile application for IOS and Android using native technologies. We also develop backend systems and API's for mobile apps."
        },
        "design": {
            "title": "Design",
            "paragraph": "We craft clean and elegant UI's with great user experience. We value simple content structures, clean design patterns and thoughtful interactions."
        },
        "integration": {
            "title": "Integration",
            "paragraph": "We can deal with software integrations to build scalable and solid architectures to guarantee long-lasting competitive advantages."
        },
        "migration": {
            "title": "Migration",
            "paragraph": "We can deal with legacy systems and migrate them to new platforms. We will make sure to safely backup your data to assure a smooth and easy migration."
        },
        "consultancy": {
            "title": "Consultancy",
            "paragraph": "We provide general IT consultancy to agencies and startups that need to create digital products for their businesses from the initial prototype to completion."
        },
        "whattheysay": {
            "title": "What they say about us",
            "paragraph": "\"The guys did a great job in migrating our platform to the new version of Redhat Openshift. They were always available for support and always handled our issues in a timely manner.\""
        }
    },
    "about":{
        "title": "About",
        "dedicated": {
            "title": "Dedicated.",
            "paragraph": "We are a small team and we thrive for quality. We will focus exclusively on your project."
        },
        "client":{
            "title": "Client control.",
            "paragraph": "As client you will become part of our team throughout the whole software development lifecycle."
        },
        "process":{
            "title": "Development process.",
            "paragraph": "We have a well organized development process and we adopt the agile methodology."
        },
        "development":{
            "title": "Mobile and Web.",
            "paragraph": "We provide custom development for web and mobile apps and backend systems. We build software tailored to satisfy company's indivudual needs."
        },
        "luca": "Enthusiast, passionate and competent software engineer with 8+ years of experience designing, coding and testing software across different platforms. Self learner with a quality oriented attitude I always keep high quality standards in my coding. I regularly refresh my skills to ensure I keep up with ongoing developments.",
        "elia": "I was born in 1994. I’ve always been interested in IT since I was a child. I’m currently a student at the University of Trento attending a Master in Computer Sciences. Simultaneously, in 2011, I set up my own business and from 2017 to 2019 I collaborated with the Bruno Kessler Foundation in the Embedded System division."
    },
    "portfolio": {
        "subtitle": "Here you can find a list of our recent projects.",
        "now": {
            "title": "Now",
            "subtitle": "We are currently open for collaborations on new and existing projects. Contact us!"
        },
        "project1":{
            "title":"Gestione interventi",
            "company": "<company>Cucine Borz</company> is a company manufacturing industrial kitchens, industrial cleaning machines and refrigerators. They also provide highly specialized technical support to their clients.",
            "request": "Since Trello was not an optimal solution to manage the company's maintenance activities due to its limited searching and reporting  capabilities they requested a custom mobile application with extra functionalities able to fill the gap.",
            "solution": "We developed a custom solution that allows the user to create new activities, add trips, goods delivered to the client, log executed tasks and add attachments. The user can generate a pdf report with a summary of the performed activities and the client can sign it on the app. The app has full offline capabilities."
        },
        "project2":{
            "title":"Blue",
            "company":"<company>Needius</company> is a young startup based in Trento with the mission to improve people’s quality of living. They are focused on the development of software for kids with special needs. Blu(e) it's their main product  and it's Android application for Samsung tablets with the aim to facilitate the learning process and communication for kids affected by autism.",
            "request": "Due to the release of Openshift v.3 (Redhat Platform as a Service) the company had to migrate their platform Blu(e) from Openshift v.2 to v.3. Since it was a legacy system we had to fully understand the solution on our own with no support from the platform developers. The documentation was fairly limited and we had strict deadlines.",
            "solution": "As a result we managed to migrate successfully the entire platform making a complete data backup (database and media files) and upgrading the Android application releasing a new version. We also provided support for bug fixing activities."
        }
    },
    "how":{
        "title": "How we work",
        "subtitle": "Here a quick summary of our process.",
        "requirements":{
            "title":"Requirements",
            "paragraph":"We work closely with our customers to gather their project requirements. We go through several iterations in order to make sure we fully understand their needs. We can visit them directly at their premises but we can also do this via Hangouts or Skype."
        },
        "high":{
            "title":"High Level Design",
            "paragraph":"Pen and paper prototyping (low-fidelity) is a quick and easy way to translate high-level design concepts into tangible and testable artifacts. Wireframing is a visual representation of a product page used to arrange page elements."
        },  
        "low":{
            "title":"Low Level Design",
            "paragraph":"In this design step we turn wireframes into high-fidelity prototypes that appear and function as similar as possible to the actual product that we will ship. We usually create high-fidelity prototypes when we have a solid understanding of the product we are going to build."
        },  
        "planning":{
            "title":"Planning",
            "paragraph":"We plan our work in short development cycles of 1-2 weeks using the agile methodology. We estimate the complexity of the work that we need to perform and we assign tasks accordingly. We define short term deliverables to showcase to our clients."
        },  
        "development":{
            "title":"Development",
            "paragraph":"During the development lifecycle we do continuous deployment on platfotms like Heroku and Netlify to keep the customers up to date with the progress almost in real time."
        }
    },
    "skills": "Skills",
    "technologies": "Technologies",
    "type": "Type",
    "website": "Website",
    "company":"Company",
    "request":"Request",
    "solution": "Solution",
    "methodologies": "Methodologies",
    "tools": "Tools",
    "call": "Do you have a creative challenge for us? Hire us!",
    "cookies": "We use cookies to help give you the best experience on our site. By continuing you agree to our use of cookies.",
    "accept": "Accept",
    "decline": "Decline"
}