{
  "nav": {
      "about": "Chi siamo",
      "portfolio": "Portfolio",
      "contact": "Contattaci"
  },
  "home": {
    "learn": "Scopri di più",  
    "headline": "Creiamo software personalizzato per la tua attività dall’idea iniziale fino al prodotto finale",
      "description": {
          "title": "Sviluppo software per il web e mobile",
          "paragraph": "A <company>CREATIVE APPS</company> diamo vita alle tue idee. Il nostro obiettivo principale è quello di capire le <needs>esigenze</needs> del cliente attraverso una collaborazione una diretta. Sviluppiamo software <custom>personalizzato</custom>, applicazioni e siti web che aggiungono <value>vero valore</value> al business dei nostri clienti. Forniamo anche attività di <consultancy>consulenza</consultancy> da remoto per agenzie e startup per la creazione dei loro <product>prodotti digitali.</product>"
      },
      "web": {
          "title": "Sviluppo Web",
          "paragraph": "Sia nel caso il cliente abbia già un’idea di massima, oppure dei requisiti specifici mettiamo a disposizione le nostre competenze tecniche per dare vita all’idea."
      },
      "mobile": {
          "title": "Sviluppo Mobile",
          "paragraph": "Creiamo applicazioni mobile per Android e IOS usando tecnologie native e frameworks di ultima generazione. Sviluppiamo anche i relativi sistemi di backend e API’s."
      },
      "design": {
          "title": "Progettazione",
          "paragraph": "Progettiamo UI semplici e funzionali con l’obiettivo di fornire all’utente la migliore UX. Crediamo in un approccio minimale con interazioni dell’utente chiare e semplici."
      },
      "integration": {
          "title": "Integrazioni",
          "paragraph": "Possiamo effettuare integrazioni di sistemi esistenti per la costruzione di archietteture solide e scalabili, allo scopo di garantire soluzioni durature nel tempo."
      },
      "migration": {
          "title": "Migrazioni",
          "paragraph": "Ci occupiamo di effettuare migrazioni di sistemi esistenti su nuove piattaforme e attraverso il backup dei dati di rendere la migrazione semplice, veloce e efficace."
      },
      "consultancy": {
          "title": "Consulenza",
          "paragraph": "Offriamo attività di consulenza generale nel campo IT ad agenzie e startup che hanno il bisogno di creare prodotti digitali per il loro business dall’idea iniziale fino al prodotto finale."
      },
      "whattheysay": {
          "title": "Cosa dicono di noi",
          "paragraph": "\"Si sono occupati della migrazione della nostra piattaforma alla nuova versione di Openshift effettuando un ottimo lavoro. Sempre disponibili e puntuali ad effettuare attività di supporto nel caso di problemi e interruzioni.\""
      }
  },
  "about":{
      "title": "Chi siamo",
      "dedicated": {
          "title": "Attività dedicata.",
          "paragraph": "Siamo una piccola azienda e puntiamo alla qualità. Ci concentreremo esclusivamente sul tuo progetto."
      },
      "client":{
          "title": "Cliente al centro del progetto.",
          "paragraph": "Il cliente diventa parte del nostro team seguendo passo passo tutta l’attività di sviluppo."
      },
      "process":{
          "title": "Processi di sviluppo.",
          "paragraph": "Abbiamo processi di sviluppo ben organizzati, collaudati nel tempo e utilizziamo metodologie agile."
      },
      "development":{
          "title": "Mobile e Web.",
          "paragraph": "Sviluppiamo software personalizzato per il web, mobile e sistemi di backend. Le nostre soluzioni sono fatte su misura per soddisfare i bisogni di ogni cliente."
      },
      "luca": "Sviluppatore con 8+ anni di esperienza nella progettazione, sviluppo e testing di software. Ho una particolare attenzione alla qualità e ai dettagli sia nelle attività di sviluppo che nella gestione del progetto. Sono in continuo aggiornamento attraverso studio personale con lo scopo di rimanere al passo con i tempi con le ultime tecnologie nell’ambito web e mobile.",
      "elia": "Nato nel 1994 da sempre interessato all’ambito IT fin da bambino. Al momento frequento l’ultimo anno di Ingegneria Informatica all’università di Trento. Nel 2011 ho creato la mia attività e dal 2017 al 2019 ho collaborato come ricercatore alla fondazione Bruno Kessler nella divisione Sistemi Embedded."
  },
  "portfolio": {
      "subtitle": "Qui potete trovare alcuni dei nostri progetti più recenti.",
      "now": {
        "title": "Ora",
        "subtitle": "Siamo alla ricerca di collaborazioni per progetti nuovi o esistenti. Contattaci!"
    },
      "project1":{
          "title":"Gestione interventi",
          "subtitle": "L' applicazione permette di organizzare e pianificare gli interventi di assistenza e consulenza, mantenendo uno storico completo. ",
          "paragraph": "Dall’applicazione mobile e dalla applicazione web sarà possibile creare gli interventi, inserire viaggi, materiali consegnati, ore di lavoro dei tecnici, attività eseguite, file allegati e foto. Inoltre dall'applicazione mobile sarà possibile generare un rapportino di lavoro con firma del cliente. Il tutto funzionante anche quando il device è offline."
      },
      "project2":{
          "title":"Blue",
          "subtitle": "Applicazione Android per tablet Samsung che favorisce il processo di apprendimento per bambini con problemi cognitivi come ad esempio l’autismo.",
          "paragraph": "Ci siamo occupati della migrazione dell’intera piattaforma da Openshift versione 2 a versione 3 e del rilascio dell’applicazione Android e di attività di supporto e bug fixing."
      }
  },
  "skills": "Competenze",
  "technologies": "Tecnologie",
  "type": "Tipo",
  "website": "Sito Web"
}